/* eslint-disable prettier/prettier */
import React, {Component} from 'react';
import {
  StyleSheet,
  ScrollView,
  Platform,
  TouchableOpacity,
  View,
  Text,
} from 'react-native';

export default class Measurement extends Component {
  constructor(props) {
    super(props);

    this.state = {
      loading: true,
    };

    this.menuArray = [
      'أرز و بسله و لحم محمر',
      'أرز و بسله و لحم كمونية',
      'أرز و بسله و دجاج محمر',
      'أرز و بسله و دجاج مشوى فوق الموقد',
      'أرز و بسله ودجاج مشوى فى الفرن',
      'أرز و فاصولياء و لحم محمر',
      'أرز و فاصولياء و لحم كمونية',
      'أرز و فاصولياء و دجاج محمر',
      'أرز و فاصولياء و دجاج مشوى فوق الموقد',
      'أرز و فاصولياء ودجاج مشوى فى الفرن',
      'أرز و سبانخ و لحم كمونية',
      'أرز و سبانخ و دجاج محمر',
      'أرز و سبانخ و دجاج مشوى فوق الموقد',
      'أرز و سبانخ ودجاج مشوى فى الفرن',
      'مكرونه بشاميل',
      'أرز بشاميل',
      'أرز بكبد و قوانص الدجاج',
      'كباب حله و أرز بالخلطه و شوربه لسان عصفور و سلطه طحينه و سلطه خضراء',
      'أرز ابيض و قلقاس بالسلق و فراخ محمره شوربه و سلطه خضراء',
      'صينيه مسقعة و شوربه عدس مع عيش محمص مربعات بدل العيش',
      'ادبحى علبة تونه',
      'بيتزا باللحمة المفرومة',
      'بطاطس و جبنة حادقة و شوية فول',
      'فتة و لحمة',
      'قرص بيض و فول و باذنجان مقلى بالخلطة',
      'صنيه بطاطس بالفراخ و أرز',
      ' بانيه و مكرونه و بطاطس محمره',
      'شاورما و بطاطس محمره و مكرونه او في سندوتشات',
      'بانيه و بشاميل و سلطه',
      'أرز و ملوخيه و فراخ محمره',
      ' كبسه فراخ و سلطه طماطم و سلطه زبادي و شوربه',
      'فراخ مشويه و أرز في الفرن و صينيه خضار',
      'لحمه مكعبات بالبصل و أرز و ملوخيه',
      'لحمه بفتيك و مكرونه',
      'صنيه بطاطس باللحمه و أرز',
      'صنيه خضار باللحمه و أرز',
      'فته و لحمه و أرز',
      'كفته و مكرونه و بطاطس محمره و طحينه',
      'صنيه كفته بالبطاطس و أرز',
      'كفته مشويه و بطاطس محمره في سندوتشات',
      'صنيه بطاطس بيوريه و شوربه و فراخ',
      ' لحمه و قلقاس و أرز',
      'لحمه و باميه و أرز',
      'كبسه باللحمه و سلطه طماطم و سلطه زبادي و شوربه',
      'لحمه مفرومه بالصلصه و اسباجيتي بالزبده و بطاطس محمره',
      'سمك مشوي و أرز صياديه و سلطه و طحينه',
      'سمك مقلي و أرز صياديه و سلطه',
      'سمك صنيه و أرز صياديه و سلطه',
      'تونه و بطاطس محمره',
      'رنجه و بطاطس محمره',
      'مسقعه و أرز',
      ' لوبيا و أرز',
      'تونه و بطاطس و بيض',
      'فول بالطماطم و بيض و تونه',
      'محشي اي نوعين',
      'مكرونه و بطاطس محمره',
      'صنيه جلاش بالبسطرمه والجبنه التركي',
      ' شوربه عدس و فته عدس و جبنه قريش',
      'كشري اصفر و بيض متحمر و سلطه',
      'كشري مصري و بطاطس محمره',
      'عجه و بطاطس و جبنه قريش',
      'كبده و مكرونه و بطاطس محمره',
      'سجق و مكرونه و بطاطس محمره',
      'كبده و سجق في سندوتشات',
      'بيتزا',
      'شكشوكة',
      'همبورجر ومكرونة',
      'كبدة اسكندراني',
    ];
  }

  render() {
    return (
      <View>
        <Text style={styles.TitleStyle}>قائمة الطعام</Text>

        <ScrollView>
          {this.menuArray.map((item, key) => (
            <TouchableOpacity key={key}>
              <Text style={styles.TextStyle}> {item} </Text>
            </TouchableOpacity>
          ))}
        </ScrollView>
      </View>
    );
  }
}

const styles = StyleSheet.create({
  MainContainer: {
    flex: 1,
    margin: 2,
    paddingTop: Platform.OS === 'ios' ? 20 : 0,
  },

  TextStyle: {
    fontSize: 15,
    color: '#000',
    textAlign: 'right',
  },
  BodyStyle: {
    marginTop: 25,
    backgroundColor: '#BF3FBF',
  },
  button: {
    backgroundColor: '#BF3FBF',
  },
});
